"""
Завдання: Бінарний пошук у відсортованому списку

Мета:
    Освіжити знання про:
    - роботу з індексами та зрізами;
    - ітеративні алгоритми;
    - контроль потоку виконання (if / elif / else);
    - мислення в термінах "звуження простору пошуку".

Умова:
    Реалізуйте функцію бінарного пошуку, яка шукає заданий елемент у відсортованому списку цілих чисел.

    Функція повинна повертати:
    - індекс елемента, якщо він знайдений;
    - -1, якщо елемент відсутній у списку.

Вимоги:
    - список гарантовано відсортований за зростанням;
    - реалізація має бути ітеративною (без рекурсії);
    - використовуйте if / elif / else для обробки умов;
    - функція не повинна нічого друкувати.

Приклад:
    >>> binary_search([2, 5, 7, 9, 11, 17, 222], 11)
    4

    >>> binary_search([2, 5, 7, 9, 11, 17, 222], 12)
    -1

Аналітична частина:
    У докстрінгу функції додай відповіді на питання (коротко):
    1. Яка часова складність алгоритму за Big-O нотацією? І чому?
    2. Яка просторова складність за Big-O нотацією? І чому?
"""


def binary_search(data: list[int], target: int) -> int:
    # TODO: implement binary search
    first_idx = 0
    last_idx = len(data) - 1

    while first_idx <= last_idx:
        mid_idx = (first_idx + last_idx) // 2
        if data[mid_idx] == target:
            return mid_idx
        elif data[mid_idx] < target:
            first_idx = mid_idx + 1
        else:
            last_idx = mid_idx - 1

    return -1
