"""
Завдання: Квадрати парних чисел (map + filter)

Мета:
    Освіжити знання про:
    - функції вищого порядку;
    - map() та filter();
    - lambda-функції;
    - lazy ітератори в Python.

Умова:
    Є список цілих чисел від 1 до 10 включно.
    Необхідно створити нову послідовність, елементами якої є квадрати лише парних чисел з цього списку.

Вимоги:
    - використовуйте filter() для відбору парних чисел;
    - використовуйте map() для піднесення чисел до квадрату;
    - використовуйте lambda-функції;
    - не використовуйте list comprehension;
    - функція не повинна нічого друкувати.

Результат:
    Функція повинна повертати список цілих чисел.

Приклад:
    >>> even_squares([1, 2, 3, 4, 5])
    [4, 16]

Аналітична частина:
    У докстрінгу функції додай відповіді на питання (коротко):
    1. Яка часова складність алгоритму за Big-O нотацією? І чому?
    2. Яка просторова складність за Big-O нотацією? І чому?
"""


def even_squares(numbers: list[int]) -> list[int]:
    # O(n) - because we iterate through the list once
    # O(n) - because we create a new list
    return list(map(lambda x: x**2, filter(lambda x: x % 2 == 0, numbers)))
