"""
Завдання:
    Є дві комірки памʼяті - memory1 і memory2. Програма кожної секунди
    потребує дедалі більше памʼяті: на першій секунді виділяється 1 біт,
    на другій - 2 біти, на третій - 3 біти і так далі.

    На кожному кроці:
        1. Визначити, у якій комірці більше доступної памʼяті.
           Якщо обсяг однаковий - обрати memory1.
        2. Спробувати виділити поточний обсяг памʼяті.
        3. Якщо жодна комірка не може виділити потрібний обсяг - програма має закінчити виконання.

    Потрібно симулювати виділення памʼяті та повернути таку структуру:
        [час_падіння, memory1_залишок, memory2_залишок].

Вимоги:
    - Процес починається з кроку 1 (виділення 1 біта);
    - На кожному наступному кроці виділяється на 1 біт більше, ніж на попередньому;
    - Заборонено створювати зайві копії даних;
    - Рішення має працювати для великих значень memory1 і memory2.

Приклад:
    memory1 = 8, memory2 = 11 -> [6, 0, 4] = [час_падіння, memory1_залишок, memory2_залишок]
        - Перша секунда: 1 біт пам’яті виділяється з memory2, залишається 10 біт доступної пам’яті;
        - Друга секунда: 2 біти пам’яті виділяються з memory2, залишається 8 біт;
        - Третя секунда: 3 біти пам’яті виділяються з memory1, тепер там 5 біт;
        - Четверта секунда: 4 біти пам’яті виділяються з memory2, залишається 4 біти;
        - Пʼята секунда: 5 біт пам’яті виділяються з memory1. Там тепер 0 біт;
        - Шоста секунда: програма завершує виконання. memory1 та memory2 мають 0 і 4 біти відповідно.

Актуальність:
    Це спрощена модель роботи системного алокатора, де обсяг запиту ресурсів зростає з часом.
    Подібні сценарії важливі для розуміння:
        - механіки інкрементальних memory leaks;
        - поведінки алокаторів, що працюють послідовно;
        - прогнозування моменту вичерпання ресурсу;
        - моделювання навантаження;
        - розподілу ресурсів між потоками/процесами;
        - throttling і rate limiting логіки.
    Уміння моделювати та аналізувати такий ріст споживання памʼяті - важлива
    навичка для backend, systems та performance інженерів.
"""


def simulate_memory_leak(memory1: int, memory2: int) -> list[int]:
    # TODO: implement solution
    ...
