"""
Завдання:
    Є набір задач, кожна з яких описана двома числами:
    - enqueue_time - час, коли задача стає доступною,
    - processing_time - час, необхідний для її виконання.

    У нас однопоточна програма, тобто може виконуватися лише одна задача в один момент часу.

    На кожному кроці CPU працює за такими правилами:
        1.	Якщо CPU вільний і немає доступних задач, він просто чекає.
        2.	Якщо CPU вільний і є доступні задачі,
            - обрати задачу з найменшим processing_time;
            - якщо таких кілька - обрати ту, що має менший індекс.
        3.	Почавши виконання задачі, CPU виконує її до кінця, без переривань.
        4.	CPU може переходити до наступної задачі миттєво після завершення попередньої.

    Потрібно симулювати роботу CPU та повернути порядок, у якому задачі були виконані (список індексів).

Приклад для tasks = [[7,10], [7,12], [7,5], [7,4], [7,2]] (це набори [enqueue_time, processing_time])
        1. t = 7 -> доступні задачі: {0,1,2,3,4}.
            Найменший час = 2 -> CPU бере задачу 4.
        2. t = 9 -> CPU закінчує задачу 4.
            Доступні задачі: {0,1,2,3}.
            Найменший час = 4 -> CPU бере задачу 3.
        3. t = 13 -> закінчує задачу 3.
            Доступні: {0,1,2}.
            Найменший час = 5 -> CPU бере задачу 2.
        4. t = 18 -> закінчує задачу 2.
            Доступні: {0,1}.
            Найменший час = 10 -> CPU бере задачу 0.
        5. t = 28 -> закінчує задачу 0.
            Доступні: {1}.
            CPU бере задачу 1.
        6. t = 40 -> закінчує задачу 1.

        Порядок виконання: [4, 3, 2, 0, 1]

Актуальність:
    Це завдання моделює роботу однопоточного CPU - саме так поводиться Python-процес під час виконання CPU-bound коду.
    Поки задача навантажує процесор, інші задачі вимушено чекають: потоки не допоможуть, бо GIL не дозволяє двом
    потокам виконувати Python-байткод паралельно.
    Завдання формує інтуїтивне розуміння того:
        - як CPU вибирає задачі та керує чергою;
        - чому одна важка операція блокує всі інші в межах процесу;
        - що означає "CPU-bound" на практиці.
"""

from typing import Iterable


def get_task_order(tasks: Iterable[Iterable[int]]) -> Iterable[int]:
    # TODO: implement solution
    ...
