"""
Реалізувати комплексний декоратор для профілювання пам'яті в Python.

Завдання:
    Створити декоратор @memory_profile, який вимірює ключові метрики використання памʼяті.
    Формат вільний. Зробити так, як буде зручно саме тобі, щоб використовувати його для аналізу коду.
    Ідеї, що може виконувати декоратор:
        - Знімати snapshots памʼяті ДО та ПІСЛЯ виконання функції.
        - Фіксувати:
            - сумарні алокації між snapshots;
            - поточне та пікове використання памʼяті;
            - час виконання функції;
            - RSS процесу до/після.
        - Показувати топ-рядків коду, що створили найбільше алокацій.
        - Визначати "hotspots" - ймовірні місця створення копій (за кількістю та розміром алокацій).

Актуальність:
    Глибоке профілювання пам'яті - критична навичка для оптимізації Python коду,
    де великі структури даних, копії та зайві алокації можуть створювати
    приховані ботлнеки. Це дозволяє зрозуміти, де саме виникають копії,
    яка пікова памʼять потрібна коду, і як поводиться програма під навантаженням.
    Це фундаментальна техніка для систем високої пропускної здатності,
    асинхронних сервісів та задач інжинірингу даних.
"""
