def binary_search(data: list[int], target: int) -> int:
    """
    1. Часова складність: O(log n)
    Алгоритм на кожній ітерації циклу while порівнює цільове значення з елементом у середині поточного діапазону.
    Залежно від результату порівняння, половина елементів виключається з подальшого пошуку, і діапазон зменшується
    приблизно вдвічі. Таким чином, розмір області пошуку після кожної ітерації дорівнює n/2, n/4, n/8 і так далі.
    Кількість таких кроків пропорційна кількості поділів n на 2 до одиниці, що математично відповідає log₂(n).
    Отже, у найгіршому випадку алгоритм виконує O(log n) ітерацій.

    2. Просторова складність: O(1)
    Реалізація бінарного пошуку є ітеративною та не створює жодних додаткових структур даних, розмір яких залежить
    від кількості вхідних елементів. Алгоритм використовує фіксовану кількість змінних (left, right, mid),
    тому обсяг додаткової памʼяті залишається сталим незалежно від розміру вхідного списку. Відповідно, просторова
    складність алгоритму дорівнює O(1).
    """
    left = 0
    right = len(data) - 1

    while left <= right:
        mid = (left + right) // 2

        if data[mid] == target:
            return mid
        elif data[mid] > target:
            right = mid - 1
        else:
            left = mid + 1

    return -1
