from typing import Generator


def generate_numbers(n: int) -> Generator[int, None, None]:
    """
    1. Часова складність: O(n)
    Генератор ітерується по всіх цілих числах від 0 до n включно. Для кожного значення виконується стала кількість
    операцій: перевірка двох умов на ділення за модулем і, у разі виконання умови, операція yield. Незалежно від того,
    скільки значень буде згенеровано, перевірка виконується для кожного числа в діапазоні. Отже, у найгіршому випадку
    кількість операцій пропорційна n, і часова складність алгоритму дорівнює O(n).

    2. Просторова складність: O(1) (для самого генератора)
    Функція реалізована як генератор і не зберігає всі результати в памʼяті одночасно. Вона використовує лише фіксовану
    кількість змінних (i та службовий стан генератора), розмір яких не залежить від значення n. Тому додаткова памʼять,
    необхідна для роботи самого генератора, є сталою - O(1).

    Просторова складність залежить від способу споживання генератора.
    Якщо результат генератора буде повністю матеріалізований, наприклад через list(generate_numbers(n)), то додаткова
    памʼять зростатиме пропорційно кількості згенерованих елементів, і просторова складність у такому випадку стане O(k),
    де k - кількість згенерованих чисел (асимптотично це O(n)).
    """
    for i in range(n + 1):
        if i % 5 == 0 and i % 7 == 0:
            yield i


def generate_numbers_short(n: int) -> Generator[int, None, None]:
    for i in range(0, n + 1, 35):
        yield i
